src/corners/david/20211028125529-early_republic.org
#+title: Early America
#+SUBTITLE: 1789-1824
#+FILETAGS: flow

- Each state had a ratification convention.
- Antifederalists vs federalists
  - Afraid of a too powerful federal gov
  - Concerned about Bill of Rights
- Federalists are pro-constitution
  - /Federalists Papers/ are a set of papers arguing for constitution
    - Best current insight into the intentions of those writing the constitution
- New government
  - George Washington sets precedent by suppressing rebellions with force
  - Steps down after 2 terms
    - Nasty press, tired
  - 6 member supreme court
  - First cabinet appointed
    - Hamilton in treasury
    - Jefferson for secretary of state
    - Henry Knox for defense
    - [[id:B07EBDB0-92D4-43C7-AD71-FC428C47A81C][Edmund Randolph]] as attorney-general
  - Hamilton's programs
    - No federal debt
    - First National Bank
    - Agrarianism vs industrialism
- French & Haitan Revolutions
  - French revolution creates more division
    - Buildup to two parties
    - Hamilton and federalists reject French radicals arguing they destroy institutions
    - Jefferson and antifederalists support French because of concept of liberty
  - Haitian revolution creates more fear of slave revolts
- Rise of poltical parties.
  - Federalists
    - Strong centralization
    - Loose interpretation of constitution
    - Pro-wealthy
    - Pro-navy
  - Republicans
    - Less centralization
    - State banks
    - Pro ordinary people
    - Minimal navy
- Mudraking and very nasty
- John Adams
  - Immigrants vote for republicans
  - Invokes an act that says you cannot vote unless you have lived for 15 years
    - Limits voting base of opposing party
  - Sedition act
    - You get expelled from the country if you write "slanderous" things about US
- Jefferson wins next election
  - Small government
  - Funds Lewis and Clark expedition
    - Not new land, just run by the French, Spanish, and Native Americans
    - Spanish tried to arrest for trespassing but he can't find them.
  - Napoleon fails to create empire in America, goes into debt
    - Sells it to the US for 15 million
  - More pressure on Indian lands
  - Embargo Act
    - Sick of English incursion on American sailors
    - Tries to put embargo on Britain
    - America didn't matter enough so it just hurt America
- James Madison
  - Good thinker, bad president
  - Embargo repealed
  - War of 1812
    - US underfunded
    - Narrow battles
  - Federalist party splinters over war tactics
- James Munroe
  - /Era of Good Feelings/ - lack of partisanship
  - Monroe Doctrine
    - Less European intervention in American hemisphere
      - Prevent European involvement in Latin America
  - General Jackson takes Florida without consideration from anyone
  - Missouri Compromise
    - 
