docs/corners/david/20211028125529-early_republic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-31 Sun 13:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Early America</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Early America</h1> <h2 class="subtitle">1789-1824</h2> <span class="author">Taproot</span> <span class="date">2021-10-31 Sun 12:53</date></div>
</div>
<div id="content">
<ul class="org-ul">
<li>Each state had a ratification convention.</li>
<li>Antifederalists vs federalists
<ul class="org-ul">
<li>Afraid of a too powerful federal gov</li>
<li>Concerned about Bill of Rights</li>
</ul></li>
<li>Federalists are pro-constitution
<ul class="org-ul">
<li><i>Federalists Papers</i> are a set of papers arguing for constitution
<ul class="org-ul">
<li>Best current insight into the intentions of those writing the constitution</li>
</ul></li>
</ul></li>
<li>New government
<ul class="org-ul">
<li>George Washington sets precedent by suppressing rebellions with force</li>
<li>Steps down after 2 terms
<ul class="org-ul">
<li>Nasty press, tired</li>
</ul></li>
<li>6 member supreme court</li>
<li>First cabinet appointed
<ul class="org-ul">
<li>Hamilton in treasury</li>
<li>Jefferson for secretary of state</li>
<li>Henry Knox for defense</li>
<li>as attorney-general</li>
</ul></li>
<li>Hamilton's programs
<ul class="org-ul">
<li>No federal debt</li>
<li>First National Bank</li>
<li>Agrarianism vs industrialism</li>
</ul></li>
</ul></li>
<li>French &amp; Haitan Revolutions
<ul class="org-ul">
<li>French revolution creates more division
<ul class="org-ul">
<li>Buildup to two parties</li>
<li>Hamilton and federalists reject French radicals arguing they destroy institutions</li>
<li>Jefferson and antifederalists support French because of concept of liberty</li>
</ul></li>
<li>Haitian revolution creates more fear of slave revolts</li>
</ul></li>
<li>Rise of poltical parties.
<ul class="org-ul">
<li>Federalists
<ul class="org-ul">
<li>Strong centralization</li>
<li>Loose interpretation of constitution</li>
<li>Pro-wealthy</li>
<li>Pro-navy</li>
</ul></li>
<li>Republicans
<ul class="org-ul">
<li>Less centralization</li>
<li>State banks</li>
<li>Pro ordinary people</li>
<li>Minimal navy</li>
</ul></li>
</ul></li>
<li>Mudraking and very nasty</li>
<li>John Adams
<ul class="org-ul">
<li>Immigrants vote for republicans</li>
<li>Invokes an act that says you cannot vote unless you have lived for 15 years
<ul class="org-ul">
<li>Limits voting base of opposing party</li>
</ul></li>
<li>Sedition act
<ul class="org-ul">
<li>You get expelled from the country if you write "slanderous" things about US</li>
</ul></li>
</ul></li>
<li>Jefferson wins next election
<ul class="org-ul">
<li>Small government</li>
<li>Funds Lewis and Clark expedition
<ul class="org-ul">
<li>Not new land, just run by the French, Spanish, and Native Americans</li>
<li>Spanish tried to arrest for trespassing but he can't find them.</li>
</ul></li>
<li>Napoleon fails to create empire in America, goes into debt
<ul class="org-ul">
<li>Sells it to the US for 15 million</li>
</ul></li>
<li>More pressure on Indian lands</li>
<li>Embargo Act
<ul class="org-ul">
<li>Sick of English incursion on American sailors</li>
<li>Tries to put embargo on Britain</li>
<li>America didn't matter enough so it just hurt America</li>
</ul></li>
</ul></li>
<li>James Madison
<ul class="org-ul">
<li>Good thinker, bad president</li>
<li>Embargo repealed</li>
<li>War of 1812
<ul class="org-ul">
<li>US underfunded</li>
<li>Narrow battles</li>
</ul></li>
<li>Federalist party splinters over war tactics</li>
</ul></li>
<li>James Munroe
<ul class="org-ul">
<li><i>Era of Good Feelings</i> - lack of partisanship</li>
<li>Monroe Doctrine
<ul class="org-ul">
<li>Less European intervention in American hemisphere
<ul class="org-ul">
<li>Prevent European involvement in Latin America</li>
</ul></li>
</ul></li>
<li>General Jackson takes Florida without consideration from anyone</li>
<li>Missouri Compromise
<ul class="org-ul">
<li></li>
</ul></li>
</ul></li>
</ul>
</div>
</body>
</html>
